### Introduction to Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
list1 = pd.Series([9,8,7,6], index=['apple', 'banana', 'pear', 'pineapple'])
list1

apple        9
banana       8
pear         7
pineapple    6
dtype: int64

In [3]:
list1['pear']

7

In [4]:
list2 = pd.Series([1,2,3,4], index=['apple', 'orange', 'pear', 'grapefruit'])
list2

apple         1
orange        2
pear          3
grapefruit    4
dtype: int64

In [5]:
list1+list2

apple         10.0
banana         NaN
grapefruit     NaN
orange         NaN
pear          10.0
pineapple      NaN
dtype: float64

In [6]:
tab1=pd.DataFrame(np.random.rand(6,6), index='Sub1 Sub2 Sub3 Sub4 Sub5 Sub6'.split(), columns='Marks1 Marks2 Marks3 Marks4 Marks5 Marks6'.split())
tab1

        Marks1    Marks2    Marks3    Marks4    Marks5    Marks6
Sub1  0.233412  0.214292  0.515515  0.838309  0.468567  0.731599
Sub2  0.225468  0.554375  0.534512  0.884102  0.222650  0.588379
Sub3  0.129582  0.999615  0.336546  0.339744  0.886759  0.180401
Sub4  0.145751  0.388537  0.220565  0.386479  0.146205  0.726147
Sub5  0.541283  0.625345  0.560652  0.000853  0.095839  0.268318
Sub6  0.000135  0.933274  0.932171  0.099398  0.407647  0.137566

In [7]:
tab1['Marks2']

Sub1    0.214292
Sub2    0.554375
Sub3    0.999615
Sub4    0.388537
Sub5    0.625345
Sub6    0.933274
Name: Marks2, dtype: float64

In [8]:
tab1[['Marks1', 'Marks2', 'Marks3']]

        Marks1    Marks2    Marks3
Sub1  0.233412  0.214292  0.515515
Sub2  0.225468  0.554375  0.534512
Sub3  0.129582  0.999615  0.336546
Sub4  0.145751  0.388537  0.220565
Sub5  0.541283  0.625345  0.560652
Sub6  0.000135  0.933274  0.932171

In [10]:
tab1['Marks7'] = tab1['Marks1'] + tab1['Marks6']
tab1

        Marks1    Marks2    Marks3    Marks4    Marks5    Marks6    Marks7
Sub1  0.233412  0.214292  0.515515  0.838309  0.468567  0.731599  0.965011
Sub2  0.225468  0.554375  0.534512  0.884102  0.222650  0.588379  0.813846
Sub3  0.129582  0.999615  0.336546  0.339744  0.886759  0.180401  0.309984
Sub4  0.145751  0.388537  0.220565  0.386479  0.146205  0.726147  0.871898
Sub5  0.541283  0.625345  0.560652  0.000853  0.095839  0.268318  0.809601
Sub6  0.000135  0.933274  0.932171  0.099398  0.407647  0.137566  0.137701

In [11]:
tab2 = pd.DataFrame({'Roll No.' : [1,2,3,4,5], 'Name' : ['Abhi', 'Ram', 'Sita', 'Kumar', 'Preeta'], 'Subject' : ['Maths', 'English', 'Science', 'Social', 'History']})
tab2

   Roll No.    Name  Subject
0         1    Abhi    Maths
1         2     Ram  English
2         3    Sita  Science
3         4   Kumar   Social
4         5  Preeta  History

In [12]:
tab2['Roll No.']

0    1
1    2
2    3
3    4
4    5
Name: Roll No., dtype: int64

In [14]:
tab2[['Name', 'Subject']]

     Name  Subject
0    Abhi    Maths
1     Ram  English
2    Sita  Science
3   Kumar   Social
4  Preeta  History

In [15]:
tab2=tab2.drop('Roll No.', axis=1)
tab2

     Name  Subject
0    Abhi    Maths
1     Ram  English
2    Sita  Science
3   Kumar   Social
4  Preeta  History

In [16]:
tab2.drop(0)

     Name  Subject
1     Ram  English
2    Sita  Science
3   Kumar   Social
4  Preeta  History